collected-data/gfs-4-rep-results/experiement-7/run-2/fio-gfs-test-low-seq-read-tf.txt
Started: 07-04-2022--09-52-01

low-seq-read-/mnt/gfs: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-read-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-read-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=24824: Thu Apr  7 09:53:49 2022
  read: IOPS=74, BW=9487KiB/s (9715kB/s)(63.0MiB/6800msec)
    slat (nsec): min=9219, max=22280, avg=10864.20, stdev=1042.54
    clat (usec): min=12124, max=57199, avg=13470.19, stdev=3221.22
     lat (usec): min=12136, max=57211, avg=13482.71, stdev=3221.20
    clat percentiles (usec):
     |  1.00th=[12125],  5.00th=[12256], 10.00th=[12387], 20.00th=[12518],
     | 30.00th=[12518], 40.00th=[12518], 50.00th=[12518], 60.00th=[12649],
     | 70.00th=[12649], 80.00th=[12780], 90.00th=[16319], 95.00th=[19792],
     | 99.00th=[24249], 99.50th=[29230], 99.90th=[57410], 99.95th=[57410],
     | 99.99th=[57410]
   bw (  KiB/s): min= 8704, max= 9728, per=100.00%, avg=9493.08, stdev=285.42, samples=13
   iops        : min=   68, max=   76, avg=74.15, stdev= 2.23, samples=13
  lat (msec)   : 20=95.04%, 50=4.76%, 100=0.20%
  cpu          : usr=0.00%, sys=0.21%, ctx=506, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=504,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=9487KiB/s (9715kB/s), 9487KiB/s-9487KiB/s (9715kB/s-9715kB/s), io=63.0MiB (66.1MB), run=6800-6800msec
low-seq-read-/mnt/gfs: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-read-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-read-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=25473: Thu Apr  7 09:55:37 2022
  read: IOPS=78, BW=9.80MiB/s (10.3MB/s)(60.9MiB/6214msec)
    slat (nsec): min=9498, max=31638, avg=10848.81, stdev=1376.98
    clat (usec): min=12118, max=15147, avg=12736.56, stdev=265.76
     lat (usec): min=12129, max=15160, avg=12749.05, stdev=265.74
    clat percentiles (usec):
     |  1.00th=[12125],  5.00th=[12125], 10.00th=[12649], 20.00th=[12649],
     | 30.00th=[12780], 40.00th=[12780], 50.00th=[12780], 60.00th=[12780],
     | 70.00th=[12780], 80.00th=[12780], 90.00th=[12780], 95.00th=[12911],
     | 99.00th=[14091], 99.50th=[14615], 99.90th=[15139], 99.95th=[15139],
     | 99.99th=[15139]
   bw (  KiB/s): min= 9984, max=10240, per=99.96%, avg=10028.33, stdev=99.03, samples=12
   iops        : min=   78, max=   80, avg=78.33, stdev= 0.78, samples=12
  lat (msec)   : 20=100.00%
  cpu          : usr=0.00%, sys=0.21%, ctx=489, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=487,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=9.80MiB/s (10.3MB/s), 9.80MiB/s-9.80MiB/s (10.3MB/s-10.3MB/s), io=60.9MiB (63.8MB), run=6214-6214msec
low-seq-read-/mnt/gfs: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-read-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-read-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=26122: Thu Apr  7 09:57:25 2022
  read: IOPS=74, BW=9527KiB/s (9756kB/s)(62.9MiB/6758msec)
    slat (nsec): min=9219, max=29263, avg=10747.39, stdev=1380.12
    clat (usec): min=12113, max=52412, avg=13413.43, stdev=2948.57
     lat (usec): min=12125, max=52425, avg=13425.81, stdev=2948.64
    clat percentiles (usec):
     |  1.00th=[12125],  5.00th=[12256], 10.00th=[12387], 20.00th=[12518],
     | 30.00th=[12518], 40.00th=[12518], 50.00th=[12518], 60.00th=[12649],
     | 70.00th=[12649], 80.00th=[12780], 90.00th=[16319], 95.00th=[19006],
     | 99.00th=[24249], 99.50th=[27132], 99.90th=[52167], 99.95th=[52167],
     | 99.99th=[52167]
   bw (  KiB/s): min= 8960, max= 9728, per=100.00%, avg=9532.46, stdev=257.48, samples=13
   iops        : min=   70, max=   76, avg=74.46, stdev= 2.03, samples=13
  lat (msec)   : 20=96.22%, 50=3.58%, 100=0.20%
  cpu          : usr=0.06%, sys=0.13%, ctx=505, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=503,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=9527KiB/s (9756kB/s), 9527KiB/s-9527KiB/s (9756kB/s-9756kB/s), io=62.9MiB (65.9MB), run=6758-6758msec